class TextFormatter

def text
"🏛BlockChainMoneybot - это инновационная система вкладов с возможностью инвестирования во многих криптовалютах и альткойнах.
💰Вы получаете 5%, с ПН по СБ, от суммы вклада каждой криптовалюты. Плюс к этому криптовалюты будут расти в цене, поэтому вы в 3й выгоде
⚡️Вы можете вывести ваш вклад полностью через неделю.
💎Вы можете инвестировать Bitcoin, Bitcoin Cash, Bitcoin Gold, Litecoin, Dash, Ethereum, Monero, Ripple, Ethereum Classic!
📈Торговля происходит на американской бирже Bittrex, Yobit, Bitfinex
🏢Бесплатное, хранение на 3-4 месяца, как в холодном кошельке. Ваши криптовалюты в безопастности, в любом случае.
👥Партнерская программа 10-5-3-1. Вы получаете часть денег за вклад приглашенного человека
💫Отличная поддержка, решит любую проблему, вопрос
🏆Официальная технология BlockChain
Начисления каждый день
Вывод доступен в любой день!"
end

def help_text

"
⁉️Для тех кто хочет побольше узнать про торгуемые нами криптовалюты, мы подготовили для вас нужную информацию:

❕Litecoin [LTC]:
https://ru.wikipedia.org/wiki/Litecoin

❕Bitcoin [BTC]:
https://ru.wikipedia.org/wiki/Биткойн

❕Bitcoin Cash [BCH]:
https://ru.m.wikipedia.org/wiki/Bitcoin_Cash

❕Bitcoin Gold [BTG]:
https://ru.m.wikinews.org/wiki/Состоялся_хардфорк_Bitcoin_Gold

❕Ethereum Classic [ETC]:
https://ru.m.wikipedia.org/wiki/Ethereum_Classic

❕Ethereum [ETH]:
https://ru.m.wikipedia.org/wiki/Ethereum

❕Dash [DASH]:
https://ru.m.wikipedia.org/wiki/Dash_(криптовалюта)

❕Monero [XMR]:
https://ru.m.wikipedia.org/wiki/Monero

❕Ripple [XRP]:
https://ru.m.wikipedia.org/wiki/Ripple
"


end

def partners_text

"Партнерская программа:

Всего партнеров:
Количество активных:
Количество неактивных:

Всего инвестировано в Вашей команде на сумму: 0 USD

Инвестировано в 1-ой линии в сумме всего: 0 USD
Инвестировано во 2-ой и последующих линиях в сумме всего: 0 USD

Заработано с 1-ой линии в сумме: 0.00 USD
Заработано со 2-ой и последующих линий в сумме: 0.00 USD

Ваш пригласитель:"

end


end
