class TextFormatter


def depo_btc_text
"Bitcoin:
От 0.000057 до 0.011 - 3%
От 0.012 до 0.028 - 4%
От 0.029 до 2 - 5%"
end

def depo_bch_text
"Bitcoin Cash:
от 0.00044 до 0.09 - 3%
от 0.1 до 0.22 - 4%
от 0.23 до 5 - 5%"
end

def depo_ltc_text
"Litecoin:
от 0.0030 до 0.6 - 3%
от 0.61 до 1.43 - 4%
от 1.44 до 40 - 5%"
end


def depo_eth_text
"Ethereum:
от 0.0012 до 0.25 - 3%
от 0.26 до 0.62 - 4%
от 0.63 до 20 - 5%"	
end

def depo_dash_text
"DASH:
от 0.0009 до 0.18 - 3%
от 0.19 до 0.44 - 4%
от 0.45 до 15 - 5%"
end



def text
"⭐️CryptoMagicalBot - это инновационная система доверительного инвестирования, с возможностью инвестирования, одновременно, в 5 быстрорастущих криптоактивов!
💰Вы получаете 3% каждые сутки, от суммы вклада каждого криптоактива. Плюс к этому криптоактивы имеют хороший потенциал для роста, что дополнительно принесет вам копеечку в ваш кошелек.
📈Торговля криптоактивами ведется круглосуточно на многих мировых биржах. Независимо от тренда, даже при падении или боковом движении активов, вы постоянно будете обеспечены прибылью каждые сутки года. Мы киты своего дела
💵Вы можете инвестировать Bitcoin, Bitcoin Cash, Litecoin, Dash, Ethereum!
💸В нашем случае профессиональные мастера своего дела ведут торговлю сразу в нескольких биржах. Это Bitfinex, Bitstamp, HitBTC, BitMEX
🏢Ваши криптовалютные активы надежно хранятся на сервере, доступ к которым из вне невозможен. Ставка на холодные кошельки в вашей безопасности превыше всего.
👥Партнерская программа 10-5-3-1. Вы получаете часть денег за вклад приглашенного человека, выгодное сотрудничество.
📩Быстрая поддержка, решит любую проблему или вопрос
📅Мы заинтересованы в долгой перспективе сотрудничества вместе с вами!С уважением, команда CryptoMagic"
end

def help_text

"
🔴Раздел для общего развития и понимания, цели и сути, каждой, торгуемых нами, криптоактивов. Вся нужная информация, ведет к официальным сайтам, где вы почерпнете все, что вам нужно
"



end

def partners_text(user, ref)

"Партнерская программа:

Всего партнеров:
Количество активных:
Количество неактивных:

Всего инвестировано в Вашей команде на сумму: 0 USD

Инвестировано в 1-ой линии в сумме всего: 0 USD
Инвестировано во 2-ой и последующих линиях в сумме всего: 0 USD

Заработано с 1-ой линии в сумме: 0.00 USD
Заработано со 2-ой и последующих линий в сумме: 0.00 USD

Ваш пригласитель: #{ref}

Ваша реферальная ссылка: https://telegram.me/demo_hyip_bot?start=#{user}
"

end


end
